---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricSheetDefaultMajorLapspliceLength
source: html/9022c6ac-162a-698b-43db-0704ecd87e13.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricSheetDefaultMajorLapspliceLength Property

"Default Major Lap Splice Length": Default Major Lap Splice Length

## Syntax (C#)
```csharp
public static ForgeTypeId FabricSheetDefaultMajorLapspliceLength { get; }
```